<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"becc16b601e9f5699b69e6f0d90735bba900b6a2dc1d0f74db70d68e970078db","plan_job_ref":"Job Staging Image Build & Push #25 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7359386624","plan_hash":"b7fb6ed7f45bb218891cb3973704edd618de57c65aecd6a14bbabb3d7eba7cbe","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:22" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition will be created
+   resource "aws_ecs_task_definition" "task_definition" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = jsonencode(
            [
+               {
+                   cpu          = 250
+                   essential    = true
+                   image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:276adae3a55594713a85d232f5c169898600932f"
+                   memory       = 500
+                   name         = "dev_FastAPI_image"
+                   portMappings = [
+                       {
+                           containerPort = 5000
+                           hostPort      = 5000
                        },
                    ]
                },
            ]
        )
+       cpu                      = "500"
+       family                   = "dev-fastapi-container"
+       id                       = (known after apply)
+       memory                   = "1024"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = {
+           "Environment" = "Dev Environment"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Staging Image Build & Push #25](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7359386624)